# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11n-LSVD object detection model with P2/4 - P5/32 outputs
# Designed for lightweight small vulnerable pedestrian detection.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10-P5/32

# YOLO11n-LSVD head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, AFF, [512]] # 12: adaptive fusion P5 -> P4
  - [-1, 2, C3k2, [512, False]] # 13-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, AFF, [256]] # 15: adaptive fusion P4 -> P3
  - [-1, 1, LFEM, []] # 16: enhance small-object edges on P3
  - [-1, 2, C3k2, [256, False]] # 17-P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, AFF, [128]] # 19: adaptive fusion P3 -> P2
  - [-1, 1, LFEM, []] # 20: enhance high-resolution P2 features
  - [-1, 2, C3k2, [128, False]] # 21-P2/4

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 17], 1, AFF, [256]] # 23: adaptive fusion P2 -> P3
  - [-1, 2, C3k2, [256, False]] # 24-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, AFF, [512]] # 26: adaptive fusion P3 -> P4
  - [-1, 2, C3k2, [512, False]] # 27-P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, AFF, [1024]] # 29: adaptive fusion P4 -> P5
  - [-1, 2, C3k2, [1024, True]] # 30-P5/32

  - [[21, 24, 27, 30], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
